elfrances/esp32SkelApp/main/ble.c
#include "sdkconfig.h"

#include "app.h"
#include "ble.h"
#include "esp32.h"
#include "led.h"
#include "mlog.h"
#include "nvram.h"
#include "ota.h"
#include "wifi.h"

#ifdef CONFIG_BLE_PERIPHERAL

// We need to make this pointer file-global because the
// NimBLE API doesn't support passing it as an argument.
static AppData *appData;

// Forward declarations
static void nimbleAdvertise(void);

void blePutUINT16(uint8_t *data, uint16_t value)
{
    *data++ = (value & 0xff);
    *data = ((value >> 8) & 0xff);
}

void blePutUINT24(uint8_t *data, uint32_t value)
{
    *data++ = (value & 0xff);
    *data++ = ((value >> 8) & 0xff);
    *data = ((value >> 16) & 0xff);
}

void blePutUINT32(uint8_t *data, uint32_t value)
{
    *data++ = (value & 0xff);
    *data++ = ((value >> 8) & 0xff);
    *data++ = ((value >> 16) & 0xff);
    *data = ((value >> 24) & 0xff);
}

void blePutUINT64(uint8_t *data, uint64_t value)
{
    *data++ = (value & 0xff);
    *data++ = ((value >> 8) & 0xff);
    *data++ = ((value >> 16) & 0xff);
    *data++ = ((value >> 24) & 0xff);
    *data++ = ((value >> 32) & 0xff);
    *data++ = ((value >> 40) & 0xff);
    *data++ = ((value >> 48) & 0xff);
    *data = ((value >> 56) & 0xff);
}

uint16_t bleGetUINT16(const uint8_t *data)
{
    uint16_t value = ((uint16_t) data[1] << 8) | (uint16_t) data[0];
    return value;
}

uint32_t bleGetUINT24(const uint8_t *data)
{
    uint32_t value = ((uint32_t) data[2] <<16) | ((uint32_t) data[1] << 8) | (uint32_t) data[0];
    return value;
}

uint32_t bleGetUINT32(const uint8_t *data)
{
    uint32_t value = ((uint32_t) data[3] << 24) | ((uint32_t) data[2] << 16) | ((uint32_t) data[1] << 8) | (uint32_t) data[0];
    return value;
}


// Inbound Connection Information
typedef struct InbConnInfo {
    time_t connTime;
    uint16_t connHandle;
    bool connEstablished;
    ble_addr_t ourAddr;
    ble_addr_t peerAddr;
#ifdef CONFIG_DEVICE_CONFIG_SERVICE
    uint16_t cmdReqHandle;
    bool cmdReqIndicate;
#endif
} InbConnInfo;

static InbConnInfo inbConnInfo;

#ifdef CONFIG_DEVICE_INFO_SERVICE
// Bluetooth SIG Device Info Service
#define GATT_DEVICE_INFO_SERVICE_UUID       0x180A
#define GATT_DIS_MANUFACTURER_NAME_UUID         0x2A29  // READ
#define GATT_DIS_MODEL_NUMBER_UUID              0x2A24  // READ
#define GATT_DIS_SERIAL_NUMBER_UUID             0x2A25  // READ
#define GATT_DIS_FIRMWARE_REVISION_UUID         0x2a26  // READ
#define GATT_DIS_HARDWARE_REVISION_UUID         0x2a27  // READ

static int deviceInfoCb(uint16_t conn_handle, uint16_t attr_handle, struct ble_gatt_access_ctxt *ctxt, void *arg)
{
    uint16_t uuid = ble_uuid_u16(ctxt->chr->uuid);
    char strBuf[64];
    const char *string = "???";

    if (uuid == GATT_DIS_MANUFACTURER_NAME_UUID) {
        string = CONFIG_MANUFACTURER_NAME;
    } else if (uuid == GATT_DIS_MODEL_NUMBER_UUID) {
        string = CONFIG_MODEL_NUMBER;
    } else if (uuid == GATT_DIS_SERIAL_NUMBER_UUID) {
        snprintf(strBuf, sizeof (strBuf), "%02X%02X%02X%02X",
                appData->serialNumber[0], appData->serialNumber[1], appData->serialNumber[2], appData->serialNumber[3]);
        string = strBuf;
    } else if (uuid == GATT_DIS_FIRMWARE_REVISION_UUID) {
        snprintf(strBuf, sizeof (strBuf), "%s (%s)", appData->appDesc->version, appData->buildType);
        string = strBuf;
    } else if (uuid == GATT_DIS_HARDWARE_REVISION_UUID) {
        string = CONFIG_IDF_TARGET;
    }

    //mlog(trace, "uuid=0x%04x value=%s", uuid, string);

    return (os_mbuf_append(ctxt->om, string, strlen(string)) == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
}
#endif  // CONFIG_DEVICE_INFO_SERVICE

#ifdef CONFIG_DEVICE_CONFIG_SERVICE
// The WiFi Credentials data is a UTF-8 string that
// includes the SSID and Password strings concatenated
// using the character sequence "###" as a separator.
// For example, if SSID="ABCDE" and Password="12345"
// then the data read or written would be string:
// "ABCDE###12345".

static const size_t wifiCredMaxLen = sizeof (appData->persData.wifiSsid) + 3 + sizeof (appData->persData.wifiPasswd);

static int getWiFiCredentials(struct ble_gatt_access_ctxt *ctxt)
{
    char data[wifiCredMaxLen];
    uint16_t len = snprintf(data, sizeof (data), "%s###%s", appData->persData.wifiSsid, appData->persData.wifiPasswd);
    return (os_mbuf_append(ctxt->om, data, len) == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
}

static int setWiFiCredentials(struct ble_gatt_access_ctxt *ctxt)
{
    struct os_mbuf *om = ctxt->om;
    char *data;
    uint16_t len;
    char *ssid, *pass, *sep;

    if ((om == NULL) || (om->om_data == NULL) || (om->om_len <= 2)) {
        return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
    }

    data = (char *) om->om_data;
    len = om->om_len;
    if (len > wifiCredMaxLen) {
        return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
    }

    ssid = data;
    if ((sep = strstr(ssid, "###")) == NULL) {
        return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
    }
    *sep = '\0';    // null-terminate the SSID string

    pass = sep + 3; // Password string follows the separator
    len -= (strlen(ssid) + 3);
    pass[len] = '\0';   // null-terminate the Password string

    // Validate the individual string lengths
    if (strlen(ssid) >= sizeof (appData->persData.wifiSsid)) {
        return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
    }
    if (strlen(pass) >= sizeof (appData->persData.wifiPasswd)) {
        return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
    }

    strncpy(appData->persData.wifiSsid, ssid, sizeof (appData->persData.wifiSsid));
    strncpy(appData->persData.wifiPasswd, pass, sizeof (appData->persData.wifiPasswd));
    appData->persData.wifiPasswd[sizeof (appData->persData.wifiPasswd) - 1] = '\0';

    nvramWrite(&appData->persData);
    mlog(trace, "wifiSsid=%s wifiPasswd=%s", appData->persData.wifiSsid, appData->persData.wifiPasswd);

    return 0;
}

#ifdef CONFIG_DCS_OPERATING_STATUS_FMT_BINARY
static int getDevOperStatus(struct ble_gatt_access_ctxt *ctxt)
{
    DevOperStatus devOperStatus = {0};

    uint32_t sysUpTime = pdTICKS_TO_MS(xTaskGetTickCount() - appData->baseTicks) / 1000;
    blePutUINT32(devOperStatus.sysUpTime, sysUpTime);
    devOperStatus.utcOffset = appData->persData.utcOffset;
    devOperStatus.wifiEnabled = !appData->persData.wifiDisabled;
    blePutUINT32(devOperStatus.wifiStaIpAddr, appData->wifiIpAddr);
    blePutUINT32(devOperStatus.wifiApIpAddr, appData->wifiGwAddr);
    memcpy(devOperStatus.wifiStaMacAddr, appData->wifiMac, 6);
    devOperStatus.wifiRssi = appData->wifiRssi;
    devOperStatus.wifiChan = appData->wifiPriChan;
    memcpy(devOperStatus.blePerMacAddr, inbConnInfo.ourAddr.val, 6);
    memcpy(devOperStatus.bleCenMacAddr, inbConnInfo.peerAddr.val, 6);
    blePutUINT16(devOperStatus.freeHeapMem, (heap_caps_get_free_size(MALLOC_CAP_DEFAULT) / 1024));
    blePutUINT16(devOperStatus.maxHeapMemBlk, (heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT) / 1024));
#ifdef CONFIG_FAT_FS
    uint64_t totalBytes, freeBytes;
    if (esp_vfs_fat_info(CONFIG_FAT_FS_MOUNT_POINT, &totalBytes, &freeBytes) == ESP_OK) {
        uint16_t freeFatFsSpace = freeBytes / 1024;
        blePutUINT16(devOperStatus.freeFatFsSpace, freeFatFsSpace);
    }
#endif
    devOperStatus.msgLogLevel= msgLogGetLevel();
    devOperStatus.msgLogDest= msgLogGetDest();

    return (os_mbuf_append(ctxt->om, &devOperStatus, sizeof (devOperStatus)) == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
}
#else
static int getDevOperStatus(struct ble_gatt_access_ctxt *ctxt)
{
    WiFiConfigInfo *wifiConfigInfo = &appConfigInfo.wifiConfigInfo;
    uint32_t sysUpTime = pdTICKS_TO_MS(xTaskGetTickCount() - baseTicks) / 1000;
    char ipAddr[INET_ADDRSTRLEN];
    static char fmtBuf[256];

    snprintf(fmtBuf, sizeof (fmtBuf),
            "upTime: %lu [s]\n"
            "ipAddr: %s\n"
            "rssi: %d [dBm]\n"
            "freeMem: %u [kB]\n"
            "maxBlk: %u [kB]\n",
            sysUpTime,
            inet_ntop(AF_INET, &appData->wifiIpAddr, ipAddr, sizeof (ipAddr)),
            appData->wifiRssi,
            (unsigned) (heap_caps_get_free_size(MALLOC_CAP_DEFAULT) / 1024),
            (unsigned) (heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT) / 1024));

    return (os_mbuf_append(ctxt->om, fmtBuf, strlen(fmtBuf)) == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
}
#endif

static CmdStatus cmdStatus = { .opCode = coUnknown, .status = csUnknown };

