elfrances/esp32SkelApp/main/ble.c
static int getCmdStatus(struct ble_gatt_access_ctxt *ctxt)
{
    return (os_mbuf_append(ctxt->om, &cmdStatus, sizeof (cmdStatus)) == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
}

static CmdStatusCode restartDeviceCmd(struct os_mbuf *om)
{
    return (restartDevice() == 0) ? csSuccess : csFailed;
}

static CmdStatusCode clearConfigCmd(struct os_mbuf *om)
{
    return (clearConfig() == 0) ? csSuccess : csFailed;
}

static CmdStatusCode startOtaUpdateCmd(struct os_mbuf *om)
{
#ifdef CONFIG_OTA_UPDATE
    return (otaUpdateStart() == 0) ? csSuccess : csFailed;
#else
    return csUnsOpCode;
#endif
}

static CmdStatusCode setLogLevelCmd(struct os_mbuf *om)
{
    LogLevel logLevel;

    if (om->om_len != 2) {
        return csInvParam;
    }

    logLevel = om->om_data[1];
    if (logLevel > debug) {
        return csInvParam;
    }
    msgLogSetLevel(logLevel);

    return csSuccess;
}

static CmdStatusCode setLogDestCmd(struct os_mbuf *om)
{
    LogDest logDest;

    if (om->om_len != 2) {
        return csInvParam;
    }

    logDest = om->om_data[1];
    if (logDest > both) {
        return csInvParam;
    }
    msgLogSetDest(logDest);

    return csSuccess;
}

static int setUtcTimeCmd(struct os_mbuf *om)
{
    struct timeval utcTime = {0};
    uint32_t utcSecs;
    int8_t utcOffset;

    if (om->om_len != 6) {
        return csInvParam;
    }

    utcSecs = bleGetUINT32(&om->om_data[1]);
    utcTime.tv_sec = utcSecs;
    utcOffset = (int8_t) om->om_data[5];
    if ((utcOffset < -12) || (utcOffset > 12)) {
        return csInvParam;
    }

    if (settimeofday(&utcTime, NULL) != 0) {
        return csFailed;
    }
    appData->persData.utcOffset = utcOffset;
    nvramWrite(&appData->persData);

    mlog(info, "Date and time set!");

    return csSuccess;
}

static int setUtcOffsetCmd(struct os_mbuf *om)
{
    int8_t utcOffset;

    if (om->om_len != 2) {
        return csInvParam;
    }

    utcOffset = (int8_t) om->om_data[1];
    if ((utcOffset < -12) || (utcOffset > 12)) {
        return csInvParam;
    }

    appData->persData.utcOffset = utcOffset;
    nvramWrite(&appData->persData);

    mlog(trace, "utcOffset=%d", utcOffset);

    return 0;
}

static int setWiFiStateCmd(struct os_mbuf *om)
{
#ifdef CONFIG_WIFI_STATION
    bool enabled = false;

    if (om->om_len != 2) {
        return csInvParam;
    }

    enabled = !!om->om_data[1];

    if (wifiEnable(appData, enabled) == 0) {
        appData->persData.wifiDisabled = !enabled;
        nvramWrite(&appData->persData);
        return csSuccess;
    }

    return csFailed;
#else
    return csInvOpCode;
#endif
}

static CmdStatusCode dumpMlogFileCmd(struct os_mbuf *om)
{
    return (dumpMlogFile(true) == 0) ? csSuccess : csFailed;
}

static CmdStatusCode deleteMlogFileCmd(struct os_mbuf *om)
{
    return (deleteMlogFile(true) == 0) ? csSuccess : csFailed;
}

static int runCmd(struct ble_gatt_access_ctxt *ctxt)
{
    struct os_mbuf *om = ctxt->om;
    CmdStatusCode csc;

    if ((om == NULL) || (om->om_len < 1)) {
        return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
    }

    if (cmdStatus.status == csInProg) {
        // Last command still in progress
        return 0;
    }

    cmdStatus.opCode = om->om_data[0];
    cmdStatus.status = csInProg;

    switch (cmdStatus.opCode) {
    case coUnknown:
        csc = csSuccess;
        break;

    case coRestartDevice:
        csc = restartDeviceCmd(om);
        break;

    case coClearConfig:
        csc = clearConfigCmd(om);
        break;

    case coStartOtaUpdate:
        csc = startOtaUpdateCmd(om);
        break;

    case coSetLogLevel:
        csc = setLogLevelCmd(om);
        break;

    case coSetLogDest:
        csc = setLogDestCmd(om);
        break;

    case coSetUtcTime:
        csc = setUtcTimeCmd(om);
        break;

    case coSetUtcOffset:
        csc = setUtcOffsetCmd(om);
        break;

    case coSetWiFiState:
        csc = setWiFiStateCmd(om);
        break;

    case coDumpMlogFile:
        csc = dumpMlogFileCmd(om);
        break;

    case coDeleteMlogFile:
        csc = deleteMlogFileCmd(om);
        break;

    default:
        csc = csInvOpCode;
        mlog(warning, "Unsupported opCode 0x%02X", cmdStatus.opCode);
        break;
    }

    cmdStatus.status = csc;

    if (inbConnInfo.cmdReqIndicate) {
        // Send the Command Status via a BLE indication
        struct os_mbuf *om = ble_hs_mbuf_from_flat(&cmdStatus, sizeof (cmdStatus));
        if (om != NULL) {
            ble_gatts_indicate_custom(inbConnInfo.connHandle, inbConnInfo.cmdReqHandle, om);
        }
    }

    return 0;
}

#ifdef CONFIG_DCS_SERVICE_HELP
static const char *cmdHelp = \
    "01: Restart\n"
    "02: Clear Config\n"
    "03: OTA Update\n"
    "04: MLOG Level {0=No 1=Inf 2=Trc 3=Dbg}\n"
    "05: MLOG Dest {0=Con 1=File 2=Both}\n"
    "06: UTC Time {secs since Epoch}\n"
    "07: UTC Offset {hrs from UTC}\n"
    "08: WiFi State {0=Dis 1=Ena}\n"
    "09: Dump MLOG.TXT\n"
    "0A: Delete MLOG.TXT\n";
#endif

static int deviceConfigCb(uint16_t conn_handle, uint16_t attr_handle, struct ble_gatt_access_ctxt *ctxt, void *arg)
{
    uint16_t uuid = ble_uuid_u16(ctxt->chr->uuid);

    if (uuid == GATT_DCS_WIFI_CREDENTIALS_UUID) {
        if (ctxt->op == BLE_GATT_ACCESS_OP_READ_CHR) {
            return getWiFiCredentials(ctxt);
        } else if (ctxt->op == BLE_GATT_ACCESS_OP_WRITE_CHR) {
            return setWiFiCredentials(ctxt);
        }
    } else if (uuid == GATT_DCS_OPERATING_STATUS_UUID) {
        return getDevOperStatus(ctxt);
    } else if (uuid == GATT_DCS_COMMAND_REQUEST_UUID) {
        if (ctxt->op == BLE_GATT_ACCESS_OP_READ_CHR) {
            return getCmdStatus(ctxt);
        } else if (ctxt->op == BLE_GATT_ACCESS_OP_WRITE_CHR) {
            return runCmd(ctxt);
        }
#ifdef CONFIG_DCS_SERVICE_HELP
    } else if (uuid == GATT_DCS_COMMAND_HELP_UUID) {
        return (os_mbuf_append(ctxt->om, cmdHelp, strlen(cmdHelp)) == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
#endif
    }

    return 0;
}
#endif  // CONFIG_DEVICE_CONFIG_SERVICE

// Table of supported BLE services and their characteristics
static const struct ble_gatt_svc_def gattSvcs[] = {
#ifdef CONFIG_DEVICE_INFO_SERVICE
    {
        // Standard Device Information Service
        .type = BLE_GATT_SVC_TYPE_PRIMARY,
        .uuid = BLE_UUID16_DECLARE(GATT_DEVICE_INFO_SERVICE_UUID),
        .characteristics = (struct ble_gatt_chr_def[]) {
            {
                // Manufacturer Name
                .uuid = BLE_UUID16_DECLARE(GATT_DIS_MANUFACTURER_NAME_UUID),
                .access_cb = deviceInfoCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
            {
                // Model Number
                .uuid = BLE_UUID16_DECLARE(GATT_DIS_MODEL_NUMBER_UUID),
                .access_cb = deviceInfoCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
            {
                // Serial Number
                .uuid = BLE_UUID16_DECLARE(GATT_DIS_SERIAL_NUMBER_UUID),
                .access_cb = deviceInfoCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
            {
                // Firmware Revision
                .uuid = BLE_UUID16_DECLARE(GATT_DIS_FIRMWARE_REVISION_UUID),
                .access_cb = deviceInfoCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
            {
                // Hardware Revision
                .uuid = BLE_UUID16_DECLARE(GATT_DIS_HARDWARE_REVISION_UUID),
                .access_cb = deviceInfoCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
            {
                0,  // No more characteristics in this service
            },
        }
    },
#endif

#ifdef CONFIG_DEVICE_CONFIG_SERVICE
    {
        // Custom Device Configuration Service
        .type = BLE_GATT_SVC_TYPE_PRIMARY,
        .uuid = BLE_UUID16_DECLARE(GATT_DEVICE_CONFIG_SERVICE_UUID),
        .characteristics = (struct ble_gatt_chr_def[]) {
            {
                // WiFi Credentials
                .uuid = BLE_UUID16_DECLARE(GATT_DCS_WIFI_CREDENTIALS_UUID),
                .access_cb = deviceConfigCb,
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE,
            },
            {
                // Operating Status
                .uuid = BLE_UUID16_DECLARE(GATT_DCS_OPERATING_STATUS_UUID),
                .access_cb = deviceConfigCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
            {
                // Command Request
                .uuid = BLE_UUID16_DECLARE(GATT_DCS_COMMAND_REQUEST_UUID),
                .access_cb = deviceConfigCb,
                .val_handle = &inbConnInfo.cmdReqHandle,
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_INDICATE,
            },
#ifdef CONFIG_DCS_SERVICE_HELP
            {
                // Command Help
                .uuid = BLE_UUID16_DECLARE(GATT_DCS_COMMAND_HELP_UUID),
                .access_cb = deviceConfigCb,
                .flags = BLE_GATT_CHR_F_READ,
            },
#endif
            {
                0,  // No more characteristics in this service
            },
        }
    },
#endif

    {
        0,  // No more services
    },
};

// Format a BLE MAC address
const char *fmtBleMac(const uint8_t *addr)
{
    static char buf[20];
    snprintf(buf, sizeof (buf), "%02X:%02X:%02X:%02X:%02X:%02X",
            addr[5], addr[4], addr[3], addr[2], addr[1], addr[0]);
    return buf;
}

static int procConnectEvent(const struct ble_gap_event *event)
{
    if (event->connect.status == 0) {
        struct ble_gap_conn_desc connDesc = {0};
        ble_gap_conn_find(event->connect.conn_handle, &connDesc);

        // Set up connection state
        inbConnInfo.connTime = time(NULL);
        inbConnInfo.connHandle = event->connect.conn_handle;
        inbConnInfo.connEstablished = true;
        inbConnInfo.peerAddr = connDesc.peer_id_addr;

