elfrances/esp32SkelApp/main/ble.c
        mlog(info, "Inbound BLE connection established: connHandle=%u peer=%s",
                inbConnInfo.connHandle, fmtBleMac(inbConnInfo.peerAddr.val));

        // Let the user know...
        ledSet(on, yellow);
    }

    return 0;
}

static int procDisconnectEvent(const struct ble_gap_event *event)
{
    if (event->disconnect.conn.conn_handle == inbConnInfo.connHandle) {
        mlog(info, "Inbound BLE connection dropped: connHandle=%u reason=0x%03x", inbConnInfo.connHandle, event->disconnect.reason);

        // Clean up connection state
        inbConnInfo.connTime = 0;
        inbConnInfo.connHandle = 0;
        inbConnInfo.connEstablished = false;
        memset(&inbConnInfo.peerAddr, 0, sizeof (inbConnInfo.peerAddr));
#ifdef CONFIG_DEVICE_CONFIG_SERVICE
        inbConnInfo.cmdReqIndicate = false;
#endif

        // Start advertising again
        nimbleAdvertise();

        // Let the user know...
        ledSet(off, black);
    }

    return 0;
}

static int procTermFailureEvent(const struct ble_gap_event *event)
{
    mlog(warning, "connHandle=%u status=0x%03x", event->term_failure.conn_handle, event->term_failure.status);

    return 0;
}

static int procNotificationTxEvent(const struct ble_gap_event *event)
{
    return 0;
}

static int procSubscribeEvent(const struct ble_gap_event *event)
{
    uint16_t attrHandle = event->subscribe.attr_handle;

    //mlog(trace, "connHandle=%u attrHandle=%u notify=%u indicate=%u", event->subscribe.conn_handle, attrHandle, event->subscribe.cur_notify, event->subscribe.cur_indicate);

    if (attrHandle == 8) {
        // When the iOS LightBlue mobile app connects, it
        // enables indications on the characteristic with
        // the attribute handle 8, which we don't care...
#ifdef CONFIG_DEVICE_CONFIG_SERVICE
    } else if (attrHandle == inbConnInfo.cmdReqHandle) {
        inbConnInfo.cmdReqIndicate = event->subscribe.cur_indicate;
        mlog(info, "Command Request indications %sabled!", (inbConnInfo.cmdReqIndicate) ? "en" : "dis");
#endif
    } else {
        mlog(warning, "Unsupported attribute handle: connHandle=%u attrHandle=%u", inbConnInfo.connHandle, attrHandle);
    }

    return 0;
}

static int nimbleGapEventCb(struct ble_gap_event *event, void *arg)
{
    //mlog(trace, "event=%u stack=%u", event->type, uxTaskGetStackHighWaterMark(NULL));

    switch (event->type) {
    case BLE_GAP_EVENT_CONNECT:
        return procConnectEvent(event);

    case BLE_GAP_EVENT_DISCONNECT:
        return procDisconnectEvent(event);

    case BLE_GAP_EVENT_TERM_FAILURE:
        return procTermFailureEvent(event);

    case BLE_GAP_EVENT_CONN_UPDATE:
        break;

    case BLE_GAP_EVENT_L2CAP_UPDATE_REQ:
        break;

    case BLE_GAP_EVENT_DISC:
        break;

    case BLE_GAP_EVENT_DISC_COMPLETE:
        break;

    case BLE_GAP_EVENT_ADV_COMPLETE:
        break;

    case BLE_GAP_EVENT_ENC_CHANGE:
        break;

    case BLE_GAP_EVENT_NOTIFY_RX:
        break;

    case BLE_GAP_EVENT_NOTIFY_TX:
        return procNotificationTxEvent(event);

    case BLE_GAP_EVENT_SUBSCRIBE:
        return procSubscribeEvent(event);

    case BLE_GAP_EVENT_MTU:
        break;

    case BLE_GAP_EVENT_REPEAT_PAIRING:
        break;

    case BLE_GAP_EVENT_PHY_UPDATE_COMPLETE:
        break;

#if MYNEWT_VAL(BLE_ENABLE_CONN_REATTEMPT)
    case BLE_GAP_EVENT_REATTEMPT_COUNT:
        mlog(warning, "BLE_GAP_EVENT_REATTEMPT_COUNT: connHandle=%u reatemptCount=%u", event->reattempt_cnt.conn_handle, event->reattempt_cnt.count);
        break;
#endif

    case BLE_GAP_EVENT_DATA_LEN_CHG:
        break;

    case BLE_GAP_EVENT_LINK_ESTAB:
        break;

    default:
        mlog(warning, "Unhandled event! type=%u", event->type);
    }

    return 0;
}


static void nimbleAdvertise(void)
{
    struct ble_gap_adv_params advParams = {0};
    struct ble_hs_adv_fields advFields = {0};   // ADV_IND
    struct ble_hs_adv_fields rspFields = {0};   // SCAN_RSP
    const char *devName = ble_svc_gap_device_name();
    int rc;

    if ((rc = ble_hs_id_infer_auto(false, &inbConnInfo.ourAddr.type)) != 0) {
        mlog(fatal, "ble_hs_id_infer_auto: rc=%d", rc);
    }

    if ((rc = ble_hs_id_copy_addr(inbConnInfo.ourAddr.type, inbConnInfo.ourAddr.val, NULL)) != 0) {
        mlog(fatal, "ble_hs_id_copy_addr: rc=%d", rc);
    }

    /*
     *  Set the advertisement data included in our advertisements:
     *     o Flags (indicates advertisement type and other general info)
     *     o Advertising tx power
     *     o Device name
     *  Advertise two flags:
     *      o Discoverability in forthcoming advertisement (general)
     *      o BLE-only (BR/EDR unsupported)
     */
    advFields.flags = BLE_HS_ADV_F_DISC_GEN |
                      BLE_HS_ADV_F_BREDR_UNSUP;

    /*
     * Indicate that the TX power level field should be included; have the
     * stack fill this value automatically.  This is done by assigning the
     * special value BLE_HS_ADV_TX_PWR_LVL_AUTO.
     */
    advFields.tx_pwr_lvl_is_present = true;
    advFields.tx_pwr_lvl = BLE_HS_ADV_TX_PWR_LVL_AUTO;

    advFields.name = (uint8_t *) devName;
    advFields.name_len = strlen(devName);
    advFields.name_is_complete = true;

    if ((rc = ble_gap_adv_set_fields(&advFields)) != 0) {
        mlog(fatal, "ble_gap_adv_set_fields: rc=%d", rc);
    }

    rspFields.uuids16 = (ble_uuid16_t[]) {
#ifdef CONFIG_DEVICE_INFO_SERVICE
        // Device Info Service
        BLE_UUID16_INIT(GATT_DEVICE_INFO_SERVICE_UUID),
#endif
#ifdef CONFIG_DEVICE_CONFIG_SERVICE
        // Device Config Service
        BLE_UUID16_INIT(GATT_DEVICE_CONFIG_SERVICE_UUID),
#endif
    };
#ifdef CONFIG_DEVICE_INFO_SERVICE
    rspFields.num_uuids16++;
#endif
#ifdef CONFIG_DEVICE_CONFIG_SERVICE
    rspFields.num_uuids16++;
#endif
    rspFields.uuids16_is_complete = true;

    if ((rc = ble_gap_adv_rsp_set_fields(&rspFields)) != 0) {
        mlog(fatal, "ble_gap_adv_rsp_set_fields: rc=%d", rc);
    }

    /* Begin advertising */
    advParams.conn_mode = BLE_GAP_CONN_MODE_UND;
    advParams.disc_mode = BLE_GAP_DISC_MODE_GEN;
    if ((rc = ble_gap_adv_start(inbConnInfo.ourAddr.type, NULL, BLE_HS_FOREVER, &advParams, nimbleGapEventCb, NULL)) != 0) {
        if (rc != BLE_HS_EALREADY) {
            mlog(fatal, "ble_gap_adv_start: rc=0x%03x", rc);
        }
    }

    mlog(info, "Advertising BLE services as \"%s\" ...", devName);
}

static void nimbleOnReset(int reason)
{
    mlog(error, "reason=%d", reason);
}

static void nimbleOnSync(void)
{
    //mlog(trace, " ");

    // Ensure we have a public address
    if (ble_hs_util_ensure_addr(false) != 0) {
        mlog(fatal, "No BLE public address!");
    }

